================================================================================
String with single quotes
================================================================================

{{ 'hello world' }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string))))

================================================================================
String with double quotes
================================================================================

{{ "hello world" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string
        (string_content)))))

================================================================================
String with interpolation - simple variable
================================================================================

{{ "{form}" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string
        (string_interpolation
          (identifier))))))

================================================================================
String with interpolation - nested variable
================================================================================

{{ "{form:handle}" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string
        (string_interpolation
          (variable
            (identifier)
            (identifier)))))))

================================================================================
String with mixed content and interpolation
================================================================================

{{ "Hello {name}, welcome!" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string
        (string_content)
        (string_interpolation
          (identifier))
        (string_content)))))

================================================================================
Tag with interpolated parameter value
================================================================================

{{ form:create in="{form:handle}" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (tag
        (tag_name
          (identifier))
        (tag_method
          (identifier))
        (parameters
          (parameter
            name: (parameter_name)
            value: (string
              (string_interpolation
                (variable
                  (identifier)
                  (identifier))))))))))

================================================================================
String with escape sequence
================================================================================

{{ "hello \"world\"" }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (string
        (string_content)
        (escape_sequence)
        (string_content)
        (escape_sequence)))))

================================================================================
Integer number
================================================================================

{{ 42 }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (number))))

================================================================================
Decimal number
================================================================================

{{ 3.14 }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (number))))

================================================================================
Boolean true
================================================================================

{{ true }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (boolean))))

================================================================================
Boolean false
================================================================================

{{ false }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (boolean))))

================================================================================
Null value
================================================================================

{{ null }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (null))))

================================================================================
Array literal
================================================================================

{{ [1, 2, 3] }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (array
        (number)
        (number)
        (number)))))

================================================================================
Array with key-value pairs
================================================================================

{{ ['key' => 'value'] }}

--------------------------------------------------------------------------------

(template
  (antlers_node
    (statement_list
      (array
        (array_pair
          key: (string)
          value: (string))))))
